src/Catalogs/ИС_Ozon_КатегорииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_КатегорииТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертифицируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type_id</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аспектная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_Ozon_КатегорииТоваров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)

	Если Не Объект.Используется Тогда

		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Категория", Объект.Ссылка);

		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдалитьЗаписиВРегистре", ЭтотОбъект,
			СтруктураПараметров);

		ЗаголовокВопроса = "Удаление записий в регистрах по категории";
		ТекстВопроса 	 = "Удалить значения характеристик и сопоставления значений характеристик в регистрах сведений для категории?";

		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристики

&НаКлиенте
Процедура ХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущаяСтрока 		= Элементы.Характеристики.ТекущиеДанные;
	СтруктураПараметров = Новый Структура("Ключ", ТекущаяСтрока.Характеристика);
	ОткрытьФорму("Справочник.ИС_Ozon_Характеристики.Форма.ФормаЭлемента", СтруктураПараметров, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПризнакНеИспользовать(Команда)

	УстановитьПризнак(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакНеИспользовать(Команда)

	УстановитьПризнак(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьХарактеристики(Команда)
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед загрузкой характеристик необходимо записать объект");
		Возврат;
	КонецЕсли;

	Если Не Объект.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Категория товаров не используется. Для загрузки характеристик необходимо включить использование");
		Возврат;
	КонецЕсли;

	//ДлительнаяОперация 	= ЗагрузитьХарактеристикиНаСервере();
	//ПараметрыОжидания 	= БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ТекстСообщения = "Выполняется загрузка характеристик";
	//ПараметрыОжидания.ВыводитьСообщения = Истина;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеЗакгрузкиХарактеристик", ЭтотОбъект);

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
	ДлительнаяОперация = ЗагрузитьХарактеристикиНаСервере(); 
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания());

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗначенияХарактеристик(Команда)

	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед загрузкой характеристик необходимо записать объект");
		Возврат;
	КонецЕсли;

	Если Объект.Характеристики.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Перед загрузкой значений характеристик необходимо загрузить характеристики категории");
		Возврат;
	КонецЕсли;

	Если Не Объект.Используется Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Категория товаров не используется. Для загрузки характеристик значений необходимо включить использование");
		Возврат;
	КонецЕсли;

	//ДлительнаяОперация 	= ЗагрузитьЗначенияХарактеристикНаСервере();
	//ПараметрыОжидания 	= БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ТекстСообщения = "Выполняется загрузка значений характеристик";
	//ПараметрыОжидания.ВыводитьСообщения = Истина;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеЗакгрузкиЗначенийХарактеристик", ЭтотОбъект); 
	
	ДлительнаяОперация = ЗагрузитьЗначенияХарактеристикНаСервере(); 
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания());

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПризнак(Признак)
	;

	ВыделенныеСтроки = Элементы.Характеристики.ВыделенныеСтроки;

	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаХарактеристики = Объект.Характеристики.НайтиПоИдентификатору(ИдСтроки);
		Если Не СтрокаХарактеристики.Обязательная Тогда
			СтрокаХарактеристики.НеИспользовать = Признак;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьХарактеристикиНаСервере()

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_Ozon_Сервер.ЗагрузитьХарактеристикиКатегорий", Профиль, Объект.Ссылка);

КонецФункции

&НаКлиенте
Процедура ЗавершениеЗакгрузкиХарактеристик(Результат, СтруктураПараметров) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		Прочитать();
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьЗначенияХарактеристикНаСервере()

	Возврат ДлительныеОперации.ВыполнитьПроцедуру( ,
		"ИС_Ozon_Сервер.ЗагрузитьЗначенияХарактеристик", Профиль, , Объект.Ссылка, Истина);

КонецФункции

&НаКлиенте
Процедура ЗавершениеЗакгрузкиЗначенийХарактеристик(Результат, СтруктураПараметров) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдалитьЗаписиВРегистре(Результат, СтруктураПараметров) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьЗаписи(СтруктураПараметров.Категория);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура УдалитьЗаписи(Категория)
	ИС_Ozon_Сервер.УдалитьЗаписиВрегистрахПоКатегории(Категория);
КонецПроцедуры

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	//ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_Ozon_ВыгрузкаКарточек";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983  

#КонецОбласти
